start_text = "<b>🙋‍♀️Привет дорогой друг!</b>\n" \
             "<b>Меня зовут Осаго Макс</b>\n\n" \
             "Я был создан, чтобы помочь тебе оформить Электронный осаго и диагностические карты  на твой автомобиль.\n\n" \
             "<em>Обещаю не занимать у тебя много времени, <b>время</b> = <b>деньги</b>, поэтому все будет очень просто, быстро и максимально понятно.</em>\n\n" \
             "⏳Заказы обрабатываются: <b>с 09:00 до 22:00 по Московскому времени, а принимаются 24/7</b>\n\n" \
             "Выбери нужный пункт из меню и я с радостью тебе помогу😌"

support_text = "✳️ Гл.Админ бота: @osagomakc"
channel_text = "✳️ Наш канал: @osagomax"
not_enough_money = '❗️ У вас недостаточно средств'
soon_send_offer = '✅ <em>Данные получены, скоро мы отправим ваш заказ!</em>'
error_text = f"❗️ Некорректный ввод"
success_order_text = "✅ Ваш заказ выполнен!"
depozite_text = f"✍️ Введите сумму <em>(минимум 100 руб.)</em>:"

osago_text = f"<b>📑Электронный полис ОСАГО с занесением вашего VIN в базу РСА.</b>\n\n" \
             f"<b>Оформим ОСАГО для ЛЮБОГО УЧЕТА.</b>\n" \
             f"<em>Беларусь 🇧🇾 Армения 🇦🇲 Россия 🇷🇺  и тд.</em>\n\n" \
             f"<b>На любой вид транспорта:</b>\n" \
             f"<em>Мотоцикл 🏍 Автомобиль 🚙</em>\n" \
             f"<em>Трактор 🚜  Авто с прицепом 🚗</em>\n" \
             f"<em>Грузовой автомобиль 🚛</em>\n" \
             f"<em>А так же такси 🚕</em>\n\n" \
             f"<b>❗️Все Е-ОСАГО без выплат️ при ДТП</b>\n\n" \
             f"<em>⏳Сроки выполнения заказа от 30 мин до 2х часов при нормальной работе РСА, возможны задержки в зависимости от работы баз ЕАИСТО и РСА</em>\n\n" \
             f"<em>Свой заказ Вы получите по готовности прямо в боте. Мы гарантируем максимально возможную скорость и качество обработки ваших заказов</em>\n\n" \
             f"<em>🎁В качестве бонуса, абсолютно все полисы в бланке будут БЕЗ ОГРАНИЧЕНИЙ НА ИСПОЛЬЗОВАНИЕ ТС</em>"

osago_product_text = f'<b>Для отмены нажмите</b> "Отменить"\n\n' \
                     f'├ФИО СТРАХОВАТЕЛЯ\n' \
                     f'├ФИО СОБСТВЕННИКА\n' \
                     f'├МАРКА/МОДЕЛЬ АВТО\n' \
                     f'├VIN НОМЕР/РАМА/КУЗОВ\n' \
                     f'├НОМЕР ПТС\n' \
                     f'├НОМЕР АВТО\n' \
                     f'├ПАСПОРТ ДАННЫЕ\n\n' \
                     f'<b>❗️ Отправьте все данные в таком порядке</b>:\n' \
                     f'<em>Иванов Иван Иванович\n' \
                     f'Иванов Юрий Иванович\n' \
                     f'ГАЗ 33021\n' \
                     f'XTЕ222210Y1766420 331210Y1776033 330530Y0051022\n' \
                     f'71 MT 122911\n' \
                     f'К777РВ77\n' \
                     f'Иванов Иван Иванович\n' \
                     f'10.02.1999\n' \
                     f'15.02.2019\n' \
                     f'36 18 619487</em>'

osago_product_photo_text = "Отправьте фото:\n" \
                           f'├Паспорт собственника или права и стс либо птс\n\n' \
                           f'<b>❗️ Можно отправить несколько фото</b>'

dk_text = f"<b>📑Диагностическая карта на любое авто. Оформление Техосмотр для ЮР, ФИЗ лиц и иностранных граждан.</b>\n\n" \
          f"<b>Любая категория авто (A, B, C, D, ПРИЦЕП)</b>\n" \
          f"<em>🚖Такси</em>\n" \
          f"<em>🚘Учебная машина</em>\n" \
          f"<em>⚠️Опасные грузы</em>\n\n\n" \
          f"<code>⏳Срок выполнения заказа до 1 часа.</code>"

dk_product_text = f'<b>Для отмены нажмите</b> "Отменить"\n\n' \
                  f"├ФИО\n" \
                  f'├Примерный пробег\n' \
                  f'├Марка шин\n' \
                  f'├Тип топлива\n' \
                  f'<b>❗️ Отправьте все данные в таком порядке</b>:\n' \
                  f'<em>Иванов Иван Иванович\n' \
                  f'251000\n' \
                  f'Continental\n' \
                  f'БЕНЗИН</em>'

dk_product_photo_text = "Отправьте фото:\n" \
                        f'├ФИО\n' \
                        f'├Примерный пробег\n' \
                        f'├Марка шин\n' \
                        f'├VIN НОМЕР/РАМА/КУЗОВ\n' \
                        f'├Тип топлива\n' \
                        f'<em>Иванов Иван Иванович\n' \
                        f'251000\n' \
                        f'Continental\n' \
                        f'БЕНЗИН</em>\n' \
                        f'Фото СТС или ПТС с двух сторон\n' \
                        f'<b>❗️ Можно отправить несколько фото</b>'

auto_med_text = f"📃Медицинские справки формы 003-В/у. Для получение/замены водительского удостоверения. Без необходимости посещения НД/ПНД. За 15 минут! Возможна отправка СДЭК по Москве, МО и в регионы!!!\n" \
                f"<b>Возможно продажа оптом, цена договорная!!!</b>\n\n" \
                f"<em>⏳Сроки выполнения заказа 24 часов</em>"

auto_med_product_text = f'<b>Для отмены нажмите</b> "Отменить"\n\n' \
                        f"├ФИО\n" \
                        f'├Дата рож-ния\n' \
                        f'├Серия номер паспорта\n' \
                        f'├Кем когда выдан\n' \
                        f'├Категория прав (B, C, D)\n' \
                        f'<b>❗️ Отправьте все данные в таком порядке</b>'

auto_med_product_photo_text = "Отправьте фото:\n" \
                              f'├Паспорт данные или права и категория прав (B, C, D)\n' \
                              f'<b>❗️ Можно отправить несколько фото</b>'

karta_gai_text = "<b>Карта ву фото прав</b>"

karta_gai_product_photo_text = "Отправьте фото:\n" \
                               f'├Водительское права\n' \
                               f'<b>❗️ Можно отправить несколько фото</b>'

karta_gibdd_text = f"<b>Карта учёта гос. номера</b>"

karta_gibdd_product_text = f'<b>Для отмены нажмите</b> "Отменить"\n\n' \
                           f"├Введите Гос.Номер"

karta_gibdd_product_photo_text = "Отправьте фото:\n" \
                                 f"├Гос.Номер\n" \
                                 f'<b>❗️ Можно отправить несколько фото</b>'

search_solary_text = f"<b>Солярис нужные данные: ФИО, ГОД РОЖДЕНИЯ</b>"

search_solary_product_text = f'<b>Для отмены нажмите</b> "Отменить"\n\n' \
                             f"├ФИО\n" \
                             f"├ДАТА РОЖДЕНИЯ\n\n" \
                             f'<b>❗️ Отправьте все данные в таком порядке</b>\n' \
                             f'<em>Иванов Иван Иванович\n' \
                             f'10.02.1999</em>'

search_solary_product_photo_text = "Отправьте фото:\n" \
                                   f"├ФИО, ГОД РОЖДЕНИЯ\n" \
                                   f'<b>❗️ Можно отправить несколько фото</b>'

kasko_bank_text = f"🏦Для оформления полиса.\n\n" \
                  f"1)ФИО, дата рож-ния, серия номер паспорта, кем когда выдан, адрес регистрации, конт.номер телефона.\n" \
                  f"2)Лица допущенные к управлению( если не без огранич.)ФИО, дата рождения, ВУ, стаж вождения. \n" \
                  f"3)По ТС: марка, год выпуска, Vin, птс, гос номер, л.с, рмм.\n" \
                  f"4)Наименование банка.\n" \
                  f"5)Действительная стоимость автомобиля.\n\n" \
                  f"<em>Телефон получателя и адрес отправка (сдек)</em>\n\n" \
                  f"<em>⏳Сроки выполнения заказа от 1 до 3х суток</em>"

kasko_bank_product_text = f'<b>Для отмены нажмите</b> "Отменить"\n\n' \
                          f"├ФИО\n" \
                          f"├ДАТА РОЖДЕНИЯ\n" \
                          f"├ВУ\n" \
                          f"├СТАЖ ВОЖДЕНИЕ\n" \
                          f"├ТС ДАННЫЕ\n" \
                          f'├НАИМЕНОВАНИЕ БАНКА\n' \
                          f'├ДЕЙСТВИТЕЛЬНАЯ СТОИМОСТЬ АВТОМОБИЛЯ\n' \
                          f'├ТЕЛЕФОН НОМЕР\n\n' \
                          f'<b>❗️ Отправьте все данные в таком порядке</b>:\n' \
                          f'<em>Иванов Иван Иванович\n' \
                          f'10.02.1999\n' \
                          f'123123 2131\n' \
                          f'3 лет\n' \
                          f'71 MT 122911\n' \
                          f'тинькофф\n' \
                          f'5000000 руб\n' \
                          f'+79633693636</em>'

kasko_bank_product_photo_text = "Отправьте фото:\n" \
                                f"├Паспортные данные, ТС данные, Водительские права, Наименование банка\n" \
                                f'<b>❗️ Можно отправить несколько фото</b>'
